In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2010_0720/0030501.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(7, 29)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,28
0,"U.S. Representative, District 5 Republican 100...",NaN,NaN,"Little 8,758","Nguyen 5,937","Totals 14,695",NaN,NaN,59.6%,40.4%,...,DEKALB,100%,1739.0,1439.0,3178.0,FULTON,100%,6942.0,4424.0,11366.0
1,NaN,NaN,"Little 8,758","Nguyen 5,937","Totals 14,695",NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,59.6%,40.4%,100.0%,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CLAYTON,100%,77,74,151,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,28
4,CLAYTON,100%,77,74,151,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,DEKALB,100%,1739,1439,3178,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,FULTON,100%,6942,4424,11366,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,2,3]]]

In [9]:
df.head(5)

         0     2     3
4  CLAYTON    77    74
5   DEKALB  1739  1439
6   FULTON  6942  4424

In [10]:
df.columns = ['county', 'Fenn Little', 'Kelly Nguyen']

In [11]:
df.tail(5)

    county Fenn Little Kelly Nguyen
4  CLAYTON          77           74
5   DEKALB        1739         1439
6   FULTON        6942         4424

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

    county     candidate votes
0  CLAYTON   Fenn Little    77
1   DEKALB   Fenn Little  1739
2   FULTON   Fenn Little  6942
3  CLAYTON  Kelly Nguyen    74
4   DEKALB  Kelly Nguyen  1439

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
county       6 non-null object
candidate    6 non-null object
votes        6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '5'

In [19]:
df['party'] = 'Republican'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
Fenn Little   Republican    8758
Kelly Nguyen  Republican    5937
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party     candidate  votes
0  CLAYTON  U.S. Representative        5  Republican   Fenn Little     77
1   DEKALB  U.S. Representative        5  Republican   Fenn Little   1739
2   FULTON  U.S. Representative        5  Republican   Fenn Little   6942
3  CLAYTON  U.S. Representative        5  Republican  Kelly Nguyen     74
4   DEKALB  U.S. Representative        5  Republican  Kelly Nguyen   1439

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')